# pandas.DataFrame.nlargest
https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.nlargest.html

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'population': [59000000, 65000000, 434000,
                                  434000, 434000, 337000, 11300,
                                  11300, 11300],
                   'GDP': [1937894, 2583560 , 12011, 4520, 12128,
                           17036, 182, 38, 311],
                   'alpha-2': ["IT", "FR", "MT", "MV", "BN",
                               "IS", "NR", "TV", "AI"]},
                  index=["Italy", "France", "Malta",
                         "Maldives", "Brunei", "Iceland",
                         "Nauru", "Tuvalu", "Anguilla"])
df

          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

### 1-1. Select the 3 rows having the largest values in column "population".

In [3]:
df.nlargest(3, 'population')

        population      GDP alpha-2
France    65000000  2583560      FR
Italy     59000000  1937894      IT
Malta       434000    12011      MT

### 1-2. keep='last'

In [4]:
df.nlargest(3, 'population', keep='last')

        population      GDP alpha-2
France    65000000  2583560      FR
Italy     59000000  1937894      IT
Brunei      434000    12128      BN

#### Note: In population=434000, Malta(first) is replaced by Brunei(last).

### 1-3. keep='all'

In [5]:
df.nlargest(3, 'population', keep='all')

          population      GDP alpha-2
France      65000000  2583560      FR
Italy       59000000  1937894      IT
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN

### 1-4. Multiple columns

In [6]:
df.nlargest(3, ['population', 'GDP'])

        population      GDP alpha-2
France    65000000  2583560      FR
Italy     59000000  1937894      IT
Brunei      434000    12128      BN

In [8]:
df.nlargest(6, ['population', 'GDP'])

          population      GDP alpha-2
France      65000000  2583560      FR
Italy       59000000  1937894      IT
Brunei        434000    12128      BN
Malta         434000    12011      MT
Maldives      434000     4520      MV
Iceland       337000    17036      IS